{"id":792,"date":"2024-05-12T08:33:15","date_gmt":"2024-05-12T08:33:15","guid":{"rendered":"https:\/\/familyfarmers.co.in\/?p=792"},"modified":"2024-06-25T18:15:04","modified_gmt":"2024-06-25T18:15:04","slug":"which-milk-is-better-a1-or-a2","status":"publish","type":"post","link":"https:\/\/familyfarmers.co.in\/which-milk-is-better-a1-or-a2\/","title":{"rendered":"Which Milk is better – A1 or A2?"},"content":{"rendered":"\r\n<p>A lot of discussions is on these days- Which milk is better to give to our kids, A1 milk or A2 milk?<\/p>\r\n\r\n\r\n\r\n<p>First, let’s figure out what is the difference between the two types of milk. A1 milk, which is the most commonly used milk and is abundantly available, is obtained from cows of Western origin like Holstein, Jersey etc. and yields a large quantity of milk. The A2 milk is the milk obtained by the cows of Indian origin like Gir, Sahiwal etc.<\/p>\r\n\r\n\r\n\r\n<p>Although the source of the two milks is Cow, the two milks vary considerably in terms of the chemical composition of each. Lactose, the carbohydrate component of the milk is of different composition in both. However, it’s the protein component – casein, which is the most important deciding factor. The breakdown part of casein from A1 milk release Histidine, which leads to the formation of Histamine (Causing allergic reactions) and a component of Morphine (habit-forming drug having effects on Central Nervous System). As a result of these, the kids tend to develop allergic dermatitis (allergy on the skin), allergic rhinitis (running nose) allergic cough and asthma. Learning ability is affected by Neuro disorders like cognitive disorders and aggravated symptoms of Autism, are also caused by A1 milk, because of the presence of Morphine. The kids’ immunity is reduced, and lipid metabolism can be affected, leading to obesity and diabetes. Morphine causes constipation. Moreover, lactose intolerance is high with A1 milk.<\/p>\r\n\r\n\r\n\r\n<p>It has been observed that these symptoms subside with minimum medication, once the A1 milk is discontinued in kids with such symptoms. Such kids also show an inadequate response to medication if the milk is continued to be given to them. A2 milk, on the other hand, releases energy on the breakdown of its protein component – Proline.<\/p>\r\n\r\n\r\n\r\n<p>“Chromatography by Ion Exchange” is an effective method to determine if the milk is A1 or A2, because of the difference of the protein in the two kinds of milk.<\/p>\r\n\r\n\r\n\r\n<p>99.9% milk available in the market is A1 milk. Milk being promoted as A2 milk may be a combination of A1 &amp; A2 milk as well. Organic milk may also be A1 milk. Other sources of A2 milk- Buffalo, goat, camel, donkey, horse, sheep etc The above points clearly indicate that A2 milk is a better and healthier option to be given to kids in comparison to A1 Milk.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>A lot of discussions is on these days- Which milk is better to give to our kids, A1 milk or…<\/p>\n","protected":false},"author":1,"featured_media":794,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/posts\/792"}],"collection":[{"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/comments?post=792"}],"version-history":[{"count":1,"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/posts\/792\/revisions"}],"predecessor-version":[{"id":1855,"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/posts\/792\/revisions\/1855"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/media\/794"}],"wp:attachment":[{"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/media?parent=792"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/categories?post=792"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/familyfarmers.co.in\/wp-json\/wp\/v2\/tags?post=792"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}